/*Вам доступна база данных, принадлежащая сервису "Кинопоиск". Она включает таблицу Actors, которая хранит информацию о различных популярных актерах.

Таблица Actors
+----+-----------+-----------+------------+------------+
| id | name      | surname   | birth_date | birth_time |
+----+-----------+-----------+------------+------------+
| 1  | Robbie    | Williams  | 1974-02-13 | 12:10:00   |
| 2  | Tom       | Cruise    | 1990-10-11 | 08:25:00   |
| 3  | Christian | Bale      | 1990-12-11 | 15:40:00   |
| 4  | Chris     | Hemsworth | 1983-08-11 | 22:00:00   |
| 5  | Meryl     | Streep    | 1949-07-20 | 14:30:00   |
| 6  | Naomi     | Campbell  | 1970-05-22 | 09:30:00   |
| 7  | Cate      | Blanchett | 1969-03-21 | 13:45:00   |
| 8  | Joaquin   | Phoenix   | 1990-05-14 | 13:30:00   |
| 9  | Johnny    | Depp      | 1963-06-09 | 11:15:00   |
| 10 | Brad      | Pitt      | 1963-07-18 | 09:30:00   |
| 11 | Leonardo  | DiCaprio  | 1974-11-11 | 10:45:00   |
| 12 | Will      | Smith     | 1968-09-25 | 08:50:00   |
| 13 | Penelope  | Cruz      | 1956-06-14 | 12:00:00   |
| 14 | Tom       | Hanks     | 1956-07-10 | 12:00:00   |
| 15 | Julianne  | Moore     | 1960-01-11 | 14:20:00   |
| 16 | Emma      | Watson    | 1990-04-15 | 10:10:00   |
+----+-----------+-----------+------------+------------+
Первое поле этой таблицы содержит идентификатор актера, второе — имя, третье — фамилию, четвертое — дату рождения, пятое — время рождения.

Напишите запрос, извлекающий из предложенной базы данных информацию об актерах (имя, фамилия, дата рождения), которые родились с мая по июль включительно.

При этом в результирующей таблице дата рождения каждого актера должна быть записана в следующем формате:

<день месяца> <полное название месяца> <год>
Результат запроса
+----------+----------+--------------+
| name     | surname  | birth_date   |
+----------+----------+--------------+
| Meryl    | Streep   | 20 July 1949 |
| Naomi    | Campbell | 22 May 1970  |
| Joaquin  | Phoenix  | 14 May 1990  |
| Johnny   | Depp     | 9 June 1963  |
| Brad     | Pitt     | 18 July 1963 |
| Penelope | Cruz     | 14 June 1956 |
| Tom      | Hanks    | 10 July 1956 |
+----------+----------+--------------+
Скрипт для создания таблицы Actors
DROP TABLE IF EXISTS Actors;
CREATE TABLE Actors
(
    id         INT AUTO_INCREMENT PRIMARY KEY,
    name       VARCHAR(20),
    surname    VARCHAR(20),
    birth_date DATE,
    birth_time TIME
);

INSERT INTO Actors (name, surname, birth_date, birth_time)
VALUES ('Robbie', 'Williams', '1974-02-13', '12:10:00'),
       ('Tom', 'Cruise', '1990-10-11', '08:25:00'),
       ('Christian', 'Bale', '1990-12-11', '15:40:00'),
       ('Chris', 'Hemsworth', '1983-08-11', '22:00:00'),
       ('Meryl', 'Streep', '1949-07-20', '14:30:00'),
       ('Naomi', 'Campbell', '1970-05-22', '09:30:00'),
       ('Cate', 'Blanchett', '1969-03-21', '13:45:00'),
       ('Joaquin', 'Phoenix', '1990-05-14', '13:30:00'),
       ('Johnny', 'Depp', '1963-06-09', '11:15:00'),
       ('Brad', 'Pitt', '1963-07-18', '09:30:00'),
       ('Leonardo', 'DiCaprio', '1974-11-11', '10:45:00'),
       ('Will', 'Smith', '1968-09-25', '08:50:00'),
       ('Penelope', 'Cruz', '1956-06-14', '12:00:00'),
       ('Tom', 'Hanks', '1956-07-10', '12:00:00'),
       ('Julianne', 'Moore', '1960-01-11', '14:20:00'),
       ('Emma', 'Watson', '1990-04-15', '10:10:00');
Примечание. Записи в результирующей таблице могут быть расположены в произвольном порядке.*/
SELECT name,surname,concat_ws(' ',DAY(birth_date),monthname(birth_date),YEAR(birth_date)) AS birth_date FROM Actors
WHERE MONTH(birth_date) BETWEEN 5 AND 7;
